In [1]:
import numpy as np
import pandas as pd 
from pandas import DataFrame

In [2]:
dframe = DataFrame({'k1':['X','X','Y','Y','Z'],
                   'k2':['alpha','beta','alpha','beta','alpha'],
                   'dataset1':np.random.randn(5),
                   'dataset2':np.random.randn(5)})

In [3]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  0.277596  0.102400
1  X   beta  0.541960  0.570719
2  Y  alpha  0.285377  0.115902
3  Y   beta -1.304585  2.010891
4  Z  alpha -0.327318 -0.222733

In [4]:
group1 = dframe['dataset1'].groupby(dframe['k1'])

In [5]:
group1

In [6]:
group1.mean()

k1
X    0.409778
Y   -0.509604
Z   -0.327318
Name: dataset1, dtype: float64

In [7]:
cities = np.array(['NY','LA','LA','NY','NY'])
month = np.array(['JAN','FEB','JAN','FEB','JAN'])

In [8]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  0.277596  0.102400
1  X   beta  0.541960  0.570719
2  Y  alpha  0.285377  0.115902
3  Y   beta -1.304585  2.010891
4  Z  alpha -0.327318 -0.222733

In [9]:
dframe['dataset1'].groupby([cities, month]).mean()

LA  FEB    0.541960
    JAN    0.285377
NY  FEB   -1.304585
    JAN   -0.024861
Name: dataset1, dtype: float64

In [10]:
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X   0.409778  0.336560
Y  -0.509604  1.063397
Z  -0.327318 -0.222733

In [11]:
dframe.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha  0.277596  0.102400
   beta   0.541960  0.570719
Y  alpha  0.285377  0.115902
   beta  -1.304585  2.010891
Z  alpha -0.327318 -0.222733

In [12]:
dataset2_group = dframe.groupby(['k1','k2'])[['dataset2']]

In [14]:
dataset2_group.mean()

          dataset2
k1 k2
X  alpha  0.102400
   beta   0.570719
Y  alpha  0.115902
   beta   2.010891
Z  alpha -0.222733

In [15]:
dframe.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [16]:
for name, group in dframe.groupby('k1'):
    print('This is the {} group'.format(name))
    print(group)
    print('\n')

This is the X group
  k1     k2  dataset1  dataset2
0  X  alpha  0.277596  0.102400
1  X   beta  0.541960  0.570719


This is the Y group
  k1     k2  dataset1  dataset2
2  Y  alpha  0.285377  0.115902
3  Y   beta -1.304585  2.010891


This is the Z group
  k1     k2  dataset1  dataset2
4  Z  alpha -0.327318 -0.222733

In [18]:
for (k1,k2), group in dframe.groupby(['k1','k2']):
    print('Key1 ={} Key2 = {}'.format(k1,k2))
    print(group)
    print('\n')

Key1 =X Key2 = alpha
  k1     k2  dataset1  dataset2
0  X  alpha  0.277596    0.1024


Key1 =X Key2 = beta
  k1    k2  dataset1  dataset2
1  X  beta   0.54196  0.570719


Key1 =Y Key2 = alpha
  k1     k2  dataset1  dataset2
2  Y  alpha  0.285377  0.115902


Key1 =Y Key2 = beta
  k1    k2  dataset1  dataset2
3  Y  beta -1.304585  2.010891


Key1 =Z Key2 = alpha
  k1     k2  dataset1  dataset2
4  Z  alpha -0.327318 -0.222733

In [19]:
gr = dframe.groupby('k1')

In [20]:
gr.get_group('X')

  k1     k2  dataset1  dataset2
0  X  alpha  0.277596  0.102400
1  X   beta  0.541960  0.570719

In [21]:
group_dict = dict(list(dframe.groupby('k1')))

In [22]:
group_dict['X']

  k1     k2  dataset1  dataset2
0  X  alpha  0.277596  0.102400
1  X   beta  0.541960  0.570719

In [23]:
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes, axis=1)))

In [24]:
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0  0.277596  0.102400
 1  0.541960  0.570719
 2  0.285377  0.115902
 3 -1.304585  2.010891
 4 -0.327318 -0.222733, dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}